{
  "main.introduction": "Un <b>Fullstack Developer</b> con mas de 4 años de experiencia desarrollando software, liderando equipos de desarrollo, implementando nuevas tecnologias y dando asesoramiento tecnico a equipos de TI",
  "main.greeting": "¡Hola! Yo soy",
  "main.button": "DESCARGAR CV",
  "link.home": "Inicio",
  "link.contact": "Contacto",
  "short.information.1": "Soy un desarrollador de software por pasión, vocación y profesión",
  "short.information.2": "Me encanta aprender y compartir conocimiento",
  "short.information.3": "Amo trabajar en ambientes agiles donde puedo crecer junto al equipo",
  "short.information.4": "Me gusta ayudar a las personas a entrar al mundo del desarrollo",
  "short.information.5": "Suelo escribir y hacer videos sobre tecnología en mi tiempo libre",
  "short.experience.title": "Vista previa de la experiencia",
  "short.experience.globaltask.desc": "<br />- Acelerar el desarrollo y mejorar la confianza en el desarrollo usando la metodologia TDD haciendo tests e2e con Test Cafe.<br />- Facilitar y mejorar el desarrollo de un sistema para una fintech usando Nextjs y MaterialUI.<br />- Manejo del codigo usando GIT como controlador de versiones en Gitlab y Azure<br /><br /><b>Tech stack:</b> NestJS, Angular, Azure, Test Cafe, NextJS, Tailwind, Typescript, ESLint, Prettier, Docker, Node, MySQL.",
  "short.experience.globaltask.title": "Desarrollador de software Fullstack en Global Task (Remoto)",
  "short.experience.globaltask.date": "Ene 2022 - Actualidad (9 meses)",
  "short.experience.pamer.desc": "<br />- Promover la creación de un sistema de diseño en el frontend para que sea sólido, reutilizable y mantenible. Reduciendo el tiempo para crear nuevas pantallas en un 50%. Usando el patrón de diseño atómico en Nextjs.</br>- Facilitar y mejorar la provisión de recursos. Ahorrando el tiempo que les tomó a los desarrolladores realizar estas configuraciones en un 90% y reduciendo el margen de error que podría incrementar la facturación mensual. Uso de AWS CDK para automatizar este proceso.<br />- Automatice las implementaciones de aplicaciones y las pruebas unitarias. Reduciendo el tiempo que les tomó a los desarrolladores hacer las cargas en un 100%. Uso de ganchos de acciones de GitHub.<br /><br /><b>Tech stack:</b> NestJS, NextJS, Tailwind, Typescript, ESLint, Prettier, Jest, Cypress, AWS RDS, AWS CDK, AWS App Runner, AWS ECR, AWS S3, GitHub, GitHub Actions, Docker, Node, MySQL.",
  "short.experience.pamer.title": "Desarrollador de software en Pamer (Lima, Peru)",
  "short.experience.pamer.date": "Jul 2021 - Dic 2021 (6 meses)",
  "short.experience.cedhinfo.desc": "<br />- Ayude a desarrollar un producto más estable aumentando la cantidad de implementaciones de producción para duplicar la tasa normal a través de la administración y la capacitación que proporcioné al equipo de tecnología que dirigí.<br />- Consiga que el usuario tenga una mayor tasa de conversión aumentando las ventas mensuales en un 10% mediante la implementación de pasarelas de pago como CULQI y “Mercado Pago”.<br />- Cree y optimice consultas muy complejas reduciendo el tiempo de carga hasta en un 25% utilizando NoSQL como lenguaje de consulta en MongoDB.<br /><br /><b>Tech stack:</b> Express, Vue, JavaScript, Typescript, Pug, Git, GitHub, ESLint, Sass, Node.",
  "short.experience.cedhinfo.title": "Lider de tecnologia en Cedhinfo (Lima, Peru)",
  "short.experience.cedhinfo.date": "Ene 2021 - Jul 2021 (7 meses)",
  "short.experience.smiledu.desc": "<br />- Colaborar en el proceso de testing, selección y formación de los nuevos desarrolladores que se pusieron a mi cargo, entrevistando a poco más de 6 personas y logrando elegir 2 perfiles que se ajusten a las necesidades del equipo, siendo empático y transparente con cada uno de los postulantes.<br />- Liderar un equipo de desarrollo para hacer una refactorización completa a uno de los módulos principales de la plataforma (pagos) para mejorar la experiencia del usuario en la plataforma y ahorrar en un promedio semanal de una hora a los administradores utilizando tecnologías como Angular, Angular Material, RXJS y NGRX.<br />- Optimizar y renovar los informes en la plataforma que se utilizaron en el área administrativa para la toma de decisiones. Reduciendo el tiempo de obtención de datos hasta en un 90% y también reduciendo la facturación mensual de los servicios en la nube. Usando SQL y PL / SQL en PostgreSQL.<br /><br /><b>Tech stack:</b> JavaScript, Typescript, Express, Serverless, AWS Lambda, AWS API Gateway, AWS S3, AWS RDS, AWS CloudWatch, AWS CodeCommit, Angular 4+, Angular Material, Redux, RXJS, Git, ESLint, TSLint, Sass, Node, SQL, PostgreSQL and Pug.",
  "short.experience.smiledu.title": "Desarrollador de fullstack en Smiledu (Lima, Peru)",
  "short.experience.smiledu.date": "Dic 2018 - Dic 2020 (2 años y 1 mes)",
  "footer.contact": "<div>Como te puedo ayudar?</div><b>Contactame!</b>",
  "footer.contact.text": "Tienes algun proyecto en mente? Quieres hablar de tecnologia? \nQuieres una mentoria?",
  "tech.title": "Tecnologias",
  "tech.git.tech": "Implemente un sistema de versionamiento (semver) para que las subidas y el uso de git tags para que los cambios a producción sean mas simples de encontrar y que sean cambiables en caso de problemas.\nCree scripts de automatizacion con git para hacer cambios sobre multiples ramas, por ejemplo borrar multiples ramas que estaban en un repositorio remoto.\nMonitorear las ramas y ultimos cambios dentro de un repositorio.\nImplemente rutinas de ejecucion con Github Actions para hacer pruebas automatizadas, para construir y deployar containers a un servicio de AWS",
  "tech.git.title": "Habilidades Git",
  "tech.mongo.tech": "Uso de todas las funciones de MongoDB para filtrar, modificar y tratar la data.\nCrear una copia de la información para crear un ambiente de pruebas funcional dentro del mismo cluster.\nOptimizar el modelado de la informacion dentro de las colecciones.",
  "tech.mongo.title": "Habilidades Mongo",
  "tech.node.tech": "He trabajado en proyectos de frontend con VanillaJs de los cuales implemente animaciones, validaciones e integraciones con API's para posteriormente hacer mejoras progresivas.\nHe creado y mantenido proyectos con librerias de JS como Vue y React, de este ultimo implementando librerias como MaterialUI y hooks para formularios con validaciones.\nHice mantenimiento de proyectos backend con Nodejs, tanto un monolito alojado en un servidor en la nube como de un proyecto usando microservicios (lambda) en la nube alojados en AWS.\nRealice integraciones de diferentes frameworks backend como Express y Nestjs.",
  "tech.node.title": "Habilidades Node",
  "tech.ts.tech": "He trabajado en proyectos de frontend con Typescript usando el framework Angular.\nImplemente typescript en proyectos de frontend usando la libreria React.\nHe creado y mantenido proyectos backend con Nodejs usando Typescript como lenguaje de desarrollo para implementar conceptos de SOLID y DDD dentro de un servidor. \nColabore con la creacion de un CLI usando typescript.",
  "tech.ts.title": "Habilidades Typescript",
  "tech.css.tech": "Hice maquetaciones de interfaces con Sass usando Angular, y adaptando diseños al estandar de material.\nCon CSS adapte una guia de estilos para que su aplicacion a distintos componentes y reutilización sea mas simple.\nHice animaciones tanto en Sass como en CSS para darle mas fluidez a interfaces. En un proyecto usando las animaciones de Angular y en otro usando directivas nativas de CSS.",
  "tech.css.title": "Habilidades CSS",
  "tech.sass.tech": "Hice maquetaciones de interfaces con Sass usando Angular, y adaptando diseños al estandar de material.\nCon CSS adapte una guia de estilos para que su aplicacion a distintos componentes y reutilización sea mas simple.\nHice animaciones tanto en Sass como en CSS para darle mas fluidez a interfaces. En un proyecto usando las animaciones de Angular y en otro usando directivas nativas de CSS.",
  "tech.sass.title": "Habilidades SASS",
  "tech.sql.tech": "Manejo avanzado de bases de datos SQL, principalmente en PostgreSQL. Uso de funciones, triggers, indexes, tablas temporales, etc.\nUso de bases de datos de replica (maestro-esclavo) para un sistema altamente concurrente.\nOptimización de querys tanto en legibilidad como en rendimiento. Pase reportes de un año que tardaba mas de 30 segundos a que para la misma información tarde 2 a 3 segundos.\nUso de JSON y JSONB dentro de PostgreSQL para organizar información.",
  "tech.sql.title": "Habilidades SQL",
  "tech.react.tech": "Implemente librerias como MaterialUI, React Router DOM, TailwindUI, React Hook Form y Storybook para hacer una interfaz mas usable, dinamica y mantenible.\nCree hooks personalizados para trabajos especificos en la UI como hover y decomponiendo hooks de librerias como React Form Hook para entender mejor su funcionamiento\nUse hooks propios del lenguaje como useState, useEffect, useContext y demas propios de la libreria.\nHice prueba unitarias con testing library y jest\nUse una arquitectura Clean Code en un proyecto a gran escala usando Nextjs",
  "tech.react.title": "Habilidades React",
  "tech.vue.tech": "Hice una implementación de esta libreria en proyectos legacy que renderizaban pug, para hacerlo mas dinamico y que respondiera a las necesidades del los usuarios de manera mas fluida,\nImplemente componentes reutilizables a la par de VanillaJs para hacer mejoras continuas",
  "tech.vue.title": "Habilidades Vue",
  "tech.angular.tech": "Implemente librerias como RXJS y NGRX para mejorar el rendimiento y la mantenibilidad del proyecto.\nHice mantenimiento de un proyecto con LazyLoading para mejorar la carga y experiencia de usuario.\nTrabaje con librerias como Angular Material y Highcharts para la interfaz de usuario.\nRealice optimizaciones en logica de componentes usando mecanismos propios de Angular como pipes, change detections strategies y demas.\nUse formularios reactivos de manera extensiva para validaciones de multiples campos, de arreglos de formularios, validaciones personalizadas y demas.",
  "tech.angular.title": "Habilidades Angular",
  "tech.aws.tech": "Use servicios de AWS como: Lambda, Cloudwatch, S3, RDS, entre otros.        \nHice monitoreo a los servicios que usabamos con Cloudwatch y programe crons desde la API.        \nMe certifique en fundamentos de AWS desde migracion de un on-premise hasta aplicaciones serverless.        \nUse AWS CDK para crear una rutina practica de provision de arquitectura en la nube reutilizable, mantenible y predecible",
  "tech.aws.title": "Habilidades AWS",
  "tech.figma.tech": "Uso Figma como herramienta de maquetado de pantallas, imagenes, logos, etc.\nY uso Invision como herramienta de maquetado rapido cuando necesito plasmar ideas de una reunion en un wireframe mas visual para darle una idea al stakeholder de como quedaria.\nEste curriculum fue hecho en figma asi como todos los demas componentes visualies exceptuando imagenes.",
  "tech.figma.title": "Habilidades Figma"
}