{
  "main.introduction": "A <b>Fullstack Developer</b> with more than 4 years of experience developing software, leading development teams, implementing new fancy technologies and giving technical advice to IT teams",
  "main.greeting": "¡Hi! I'm",
  "main.button": "DOWNLOAD CV",
  "link.home": "Home",
  "link.contact": "Contact",
  "short.information.1": "I am a software developer by passion, vocation and profession",
  "short.information.2": "I love to learn and share knowledge",
  "short.information.3": "I love working in agile environments where I can grow together with the team",
  "short.information.4": "I like to help people enter the world of development",
  "short.information.5": "I usually write and make videos about technology in my spare time",
  "short.experience.title": "Experience Preview",
  "short.experience.globaltask.desc": "<br />- Accelerate development and improve confidence in development using the TDD methodology by doing e2e tests with Test Cafe.<br />- Facilitate and improve the development of a system for a fintech using Nextjs and MaterialUI.<br />- Code management using GIT as version controller in Gitlab and Azure<br /><br /><b>Tech stack:</b> NestJS, Angular, Azure, Test Cafe, NextJS, Tailwind, Typescript, ESLint, Prettier, Docker, Node, MySQL.",
  "short.experience.globaltask.title": "Fullstack software develop on GlobalTask (Remote)",
  "short.experience.globaltask.date": "Jan 2022 - Present (9 months)",
  "short.experience.pamer.desc": "<br />- Promote the creation of a design system on the frontend so that it is solid, reusable and maintainable. Reducing the time to create new screens by 50%. Using Atomic Design pattern on Nextjs.<br />- Facilitate and improve the provision of resources. Saving the time it took developers to make these configurations by 90% and reducing the margin of error that could increase monthly billing. Using AWS CDK to automate this process.<br />- Automate application deployments and unit testing. Reducing the time it took developers to do the uploads by 100%. Using GitHub Actions hooks.<br /><br /><b>Tech stack:</b> NestJS, NextJS, Tailwind, Typescript, ESLint, Prettier, Jest, Cypress, AWS RDS, AWS CDK, AWS App Runner, AWS ECR, AWS S3, GitHub, GitHub Actions, Docker, Node, MySQL.",
  "short.experience.pamer.title": "Software developer at Pamer (Lima, Peru)",
  "short.experience.pamer.date": "Jul 2021 - Dec 2021 (6 months)",
  "short.experience.cedhinfo.desc": "<br />- Help develop a more stable product by increasing the number of production deployments to double the normal rate through the management and training I provided to the technology team I led.<br />- Get the user to have a higher conversion rate increasing sales per month by 10% by implementing payment gateways such as CULQI and “Mercado Pago”.<br />- Create and optimize highly complex queries reducing load time by up to 25% using NoSQL as the query language in MongoDB.<br /><br /><b>Tech stack:</b> Express, Vue, JavaScript, Typescript, Pug, Git, GitHub, ESLint, Sass, Node.",
  "short.experience.cedhinfo.title": "Tech lead at Cedhinfo (Lima, Peru)",
  "short.experience.cedhinfo.date": "Jan 2021 - Jul 2021 (7 months)",
  "short.experience.smiledu.desc": "<br />- Collaborate in the testing, selection and training process for the new developers that came under my charge, interviewing a little more than 6 people and managing to choose 2 profiles that fit the needs of the team, being empathetic and transparent with each of the applicants.<br />- Lead a development team to do full refactoring to one of the main modules of the platform (payments) to improve the user experience on the platform and saving on a weekly average one hour to the admins using technologies such as Angular, Angular Material, RXJS and NGRX.<br />- Optimize and renew reports in the platform that were used in the administrative area for decision-making. Reducing the time it took to obtain data by up to 90% and also reducing the monthly billing of cloud services. Using SQL and PL/SQL in PostgreSQL.<br /><br /><b>Tech stack:</b> JavaScript, Typescript, Express, Serverless, AWS Lambda, AWS API Gateway, AWS S3, AWS RDS, AWS CloudWatch, AWS CodeCommit, Angular 4+, Angular Material, Redux, RXJS, Git, ESLint, TSLint, Sass, Node, SQL, PostgreSQL and Pug.",
  "short.experience.smiledu.title": "Fullstack developer at Smiledu (Lima, Peru)",
  "short.experience.smiledu.date": "Dec 2018 - Dec 2020 (2 year and 1 month)",
  "footer.contact": "<div>How can I help you?</div><b>Contact me!</b>",
  "footer.contact.text": "Do you have any project on mind? Do you want to talk about tech? \nDo you want a mentoring?",
  "tech.title": "Technologies",
  "tech.git.tech": "Implement a versioning system (semver) for uploads and the use of git tags so that changes to production are easier to find and changeable in case of problems.\nCreate automation scripts with git to make changes over multiple branches, for example delete multiple branches that were in a remote repository.\nMonitor branches and latest changes within a repository.\nImplement execution routines with Github Actions to do automated tests, to build and deploy containers to an AWS service",
  "tech.git.title": "Git Skills",
  "tech.mongo.tech": "Use of all MongoDB functions to filter, modify and process the data.\nCreate a copy of the information to create a functional test environment within the same cluster.\nOptimize the modeling of the information within the collections.",
  "tech.mongo.title": "Mongo Skills",
  "tech.node.tech": "I have worked on frontend projects with VanillaJs of which I implement animations, validations and integrations with APIs to later make progressive improvements.\nI have created and maintained projects with JS libraries such as Vue and React, the latter implementing libraries such as MaterialUI and hooks for forms with validations.\nMaintained backend projects with Nodejs, both a monolith hosted on a cloud server and a project using cloud microservices (lambda) hosted on AWS.\nIntegrated different backend frameworks such as Express and Nestjs.",
  "tech.node.title": "Node Skills",
  "tech.ts.tech": "I have worked on frontend projects with Typescript using the Angular framework.\nImplement typescript on frontend projects using the React library.\nI have created and maintained backend projects with Nodejs using Typescript as a development language to implement SOLID and DDD concepts within a server.\nCollaborate on creating a CLI using typescript.",
  "tech.ts.title": "Typescript Skills",
  "tech.css.tech": "I made interface layouts with Sass using Angular, and adapting designs to the material standard.\nWith CSS I adapted a style guide so that its application to different components and reuse is simpler.\nI made animations in both Sass and CSS to give it more fluency to interfaces. In one project using Angular animations and in another using native CSS directives.",
  "tech.css.title": "CSS Skills",
  "tech.sass.tech": "I made interface layouts with Sass using Angular, and adapting designs to the material standard.\nWith CSS I adapted a style guide so that its application to different components and reuse is simpler.\nI made animations in both Sass and CSS to give it more fluency to interfaces. In one project using Angular animations and in another using native CSS directives.",
  "tech.sass.title": "SASS Skills",
  "tech.sql.tech": "Advanced handling of SQL databases, mainly in PostgreSQL. Use of functions, triggers, indexes, temporary tables, etc. \nUse of replica databases (master-slave) for a highly concurrent system.\nOptimization of querys both in readability and performance. Spend reports from a year that took more than 30 seconds to take 2 to 3 seconds for the same information.\nUse of JSON and JSONB within PostgreSQL to organize information.",
  "tech.sql.title": "SQL Skills",
  "tech.react.tech": "Implement libraries like MaterialUI, React Router DOM, TailwindUI, React Hook Form and Storybook to make an interface more usable, dynamic and maintainable.\nCreate custom hooks for specific UI jobs like hover and decomposing hooks from libraries like React Form Hook to understand better performance\nUse language-specific hooks such as useState, useEffect, useContext and others from the library.\nI did unit tests with testing library and jest\nUse a Clean Code architecture in a large-scale project using Nextjs",
  "tech.react.title": "React Skills",
  "tech.vue.tech": "I made an implementation of this library in legacy projects that rendered pug, to make it more dynamic and respond to the needs of the users in a more fluid way\nImplemented reusable components alongside VanillaJs to make continuous improvements",
  "tech.vue.title": "Vue Skills",
  "tech.angular.tech": "Implement libraries like RXJS and NGRX to improve the performance and maintainability of the project.\nMaintained a project with LazyLoading to improve loading and user experience.\nWork with libraries like Angular Material and Highcharts for the user interface. \nPerform optimizations in component logic using Angular's own mechanisms such as pipes, change detection strategies and others. \nUse reactive forms extensively for multi-field validation, form array validation, custom validation and more.",
  "tech.angular.title": "Angular Skills",
  "tech.aws.tech": "Use AWS services like: Lambda, Cloudwatch, S3, RDS, among others.         \nI monitored the services we used with Cloudwatch and scheduled crons from the API.         \nI got certified in AWS fundamentals from on-premises migration to serverless applications.         \nUse AWS CDK to create a handy, reusable, maintainable, and predictable cloud architecture provisioning routine",
  "tech.aws.title": "AWS Skills",
  "tech.figma.tech": "I use Figma as a layout tool for screens, images, logos, etc.\nAnd I use Invision as a quick layout tool when I need to translate ideas from a meeting into a more visual wireframe to give the stakeholder an idea of ​​how it would look\nThis resume was made in figma as well as all other visual components except images.",
  "tech.figma.title": "Figma Skills"
}